package com.avp.homework11.task3_maze.bean;
/*
Написать игру.
Игровое поле - 10 х 10 ячеек. начальная позиция героя в левом верхнем углу.
Разными  символами обозначайте тропу и препятствия.
Используйте Scanner для приема символов из консоли.
Символами wasd управляйте движением героя. Место, где находится герой, обозначте симовлом "X".
Для движения героя используйте унарные инкременты/декременты и switch-case
 */

public class Maze {
    private final String[][] fieldFromGame = {
            {"X", "+", "-", "+", "+", "+", "-", "+", "+", "+"},
            {"-", "+", "-", "+", "-", "+", "-", "+", "-", "+"},
            {"-", "+", "-", "+", "-", "+", "-", "+", "-", "+"},
            {"-", "+", "-", "+", "-", "+", "-", "+", "-", "+"},
            {"-", "+", "-", "+", "-", "+", "-", "+", "-", "+"},
            {"-", "+", "-", "+", "-", "+", "-", "+", "-", "+"},
            {"-", "+", "-", "+", "-", "+", "-", "+", "-", "+"},
            {"-", "+", "-", "+", "-", "+", "-", "+", "-", "+"},
            {"-", "+", "-", "+", "-", "+", "-", "+", "-", "+"},
            {"-", "+", "+", "+", "-", "+", "+", "+", "-", "+"}

    };

    public String[][] getFieldFromGame() {
        return fieldFromGame;
    }

}
